app/views/welcome/index.html.erb

				<% @singlegame.turn = 0 %>
				<% @singlegame.save %>
---
INSERT INTO "singlegames" ("created_at", "status", "turn", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-03-27 06:01:39.061351"], ["status", "000000000"], ["turn", 0], ["updated_at", "2015-03-27 06:01:39.061351"]]

				<% @multigame.turn = 0 %>
				<% @multigame.save %>
---
INSERT INTO "multigames" ("created_at", "status", "turn", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-03-27 19:40:17.394334"], ["status", "000000000"], ["turn", 0], ["updated_at", "2015-03-27 19:40:17.394334"]]