app/views/multigames/show.html.erb

SELECT  "multigames".* FROM "multigames"  WHERE "multigames"."id" = ? LIMIT 1  [["id", 2]]
---
	<% if @multigame.id == @multigame.player1_id %>
	<p>Invite your friend using this link: <%= link_to 'Link', Multigame.find(@multigame.player2_id) %></p>