app/controllers/multigames_controller.rb

  def index
    @multigames = Multigame.all
---
SELECT "multigames".* FROM "multigames"

  def mmove
    flash[:notice] = "aa"
    if insufficient_player
      flash[:notice] = "Players not ready!"
    end
    cur = @multigame.status[@multigame.turn * 9, 9]
    if not your_turn
      flash[:notice] = "Please wait for your opponent"
    elsif ok_to_move(cur)

        if @multigame.turn >= 9 or check_win(cur)
          flash[:notice] = "Game over"
          respond_to do |format|
            format.html { redirect_to @multigame }
          end
          return
        end
        if @multigame.turn % 2 == 0
          player = "A"
        else
          player = "B"
        end

        i = params[:cell_id].to_i
        if cur[i-1, 1].to_i == 0
          cur[i-1, 1] = player
          @multigame.status += cur
          @multigame.turn += 1
          @multigame.save
---
UPDATE "multigames" SET "status" = ?, "turn" = ?, "updated_at" = ? WHERE "multigames"."id" = 1  [["status", "0000000000asd0000000"], ["turn", 1], ["updated_at", "2015-03-27 21:05:44.510673"]]

          else
            forward_id = @multigame.player1_id
          end
          @forward = Multigame.find(forward_id)
---
SELECT  "multigames".* FROM "multigames"  WHERE "multigames"."id" = ? LIMIT 1  [["id", 1]]

  def add_player
    if params[:multigame][:player1]
      @multigame.player1 = params[:multigame][:player1]
      @multigame.player1_id = @multigame.id

      @multigame2 = Multigame.new
      @multigame2.status = "000000000"
      @multigame2.turn = 0
      @multigame2.player1 = @multigame.player1
      @multigame2.player1_id = @multigame.id
      @multigame2.save
      @multigame.player2_id = @multigame2.id

      @multigame.save
      @multigame2.player2_id = @multigame2.id
      @multigame2.save
    elsif params[:multigame][:player2]
      @origin = Multigame.find(@multigame.player1_id)
---
INSERT INTO "multigames" ("created_at", "player1", "player1_auth", "status", "turn", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-03-27 21:18:56.774874"], ["player1", "kris"], ["player1_auth", 3], ["status", "000000000"], ["turn", 0], ["updated_at", "2015-03-27 21:18:56.774874"]]
UPDATE "multigames" SET "player2" = ?, "player2_auth" = ?, "updated_at" = ? WHERE "multigames"."id" = 1  [["player2", "gdgf"], ["player2_auth", "lML+HgTS8/qTaKgS3OdjbHP1M6UVTYAtnMgiMDjKlwQ="], ["updated_at", "2015-03-27 20:56:32.784131"]]
SELECT  "multigames".* FROM "multigames"  WHERE "multigames"."id" = ? LIMIT 1  [["id", 3]]

    def set_multigame
      @multigame = Multigame.find(params[:id])
---
SELECT  "multigames".* FROM "multigames"  WHERE "multigames"."id" = ? LIMIT 1  [["id", 2]]