app/controllers/singlegames_controller.rb

SELECT "singlegames".* FROM "singlegames"
---
  def index
    @singlegames = Singlegame.all

INSERT INTO "singlegames" ("created_at", "status", "turn", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-03-27 05:21:23.774985"], ["status", "000000000"], ["turn", 0], ["updated_at", "2015-03-27 05:21:23.774985"]]
---
  def create
    @singlegame = Singlegame.new(singlegame_params)
    respond_to do |format|
      if @singlegame.save

UPDATE "singlegames" SET "status" = ?, "turn" = ?, "updated_at" = ?, "winner" = ? WHERE "singlegames"."id" = 6  [["status", "0000000000000A00000B00A00000B00A000ABB00A000ABB0AA000ABB0AAB00ABB0AAB0AABB0AABBAA"], ["turn", 8], ["updated_at", "2015-03-31 21:44:33.704388"], ["winner", nil]]
---
  def undo
    if not @singlegame.winner.nil?
      flash[:notice] = "Game finished"
      respond_to do |format|
        format.html { redirect_to @singlegame }
      end
      return
    end

    if @singlegame.turn == 0
      respond_to do |format|
        format.html { redirect_to @singlegame }
      end
      return
    end
    if @singlegame.turn == 1
      @singlegame.status = "000000000"
      @singlegame.turn = 0
      @singlegame.save

UPDATE "singlegames" SET "status" = ?, "turn" = ?, "updated_at" = ? WHERE "singlegames"."id" = 51  [["status", "000000000"], ["turn", 0], ["updated_at", "2015-03-27 19:13:04.385764"]]
---
  def reset
    @singlegame.status = "000000000"
    @singlegame.turn = 0
    @singlegame.save

SELECT "singlegames".* FROM "singlegames"  WHERE (singlegames.winner IS NOT NULL)
---
  def list
    @singlegames = Singlegame.where("singlegames.winner IS NOT NULL")

UPDATE "singlegames" SET "status" = ?, "turn" = ?, "updated_at" = ? WHERE "singlegames"."id" = 16  [["status", "000000000001000000"], ["turn", 1], ["updated_at", "2015-03-27 07:11:52.046039"]]
---
  def move
    cur = @singlegame.status[@singlegame.turn * 9, 9]
    if @singlegame.turn >= 9 or check_win(cur)
      flash[:notice] = "Game over"
      respond_to do |format|
        format.html { redirect_to @singlegame }
      end
      return
    end
    if @singlegame.turn % 2 == 0
      player = "A"
    else
      player = "B"
    end

    i = params[:cell_id].to_i
    if cur[i-1, 1].to_i == 0
      cur[i-1, 1] = player
      @singlegame.status += cur
      @singlegame.turn += 1
      @singlegame.save

SELECT  "singlegames".* FROM "singlegames"  WHERE "singlegames"."id" = ? LIMIT 1  [["id", 51]]
---
    def set_singlegame
      @singlegame = Singlegame.find(params[:id])